src/cf/DataProcessors/конс_ДемоКонсоль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>конс_ДемоКонсоль</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/конс_РежимПоказаПеременных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>конс_РежимПоказаПеременных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтображать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабло</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПодсказках</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/конс_ДемоКонсоль/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма консоли кода
// 
// Пример подключения редактора bsl_console к форме.
// Минимальный код подключения - см. ПриСозданииНаСервере и ПриОткрытии.
//
// Примеры расширения функциональности - см. область "Примеры".
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// === ПОДКЛЮЧЕНИЕ РЕДАКТОРА (обязательно) ===
	// Пример с нестандартным именем элемента:
	конс_ПодключаемаяКонсольСервер.ИнициализироватьРедактор(ЭтотОбъект, УникальныйИдентификатор, "ПолеРедактора");
	
	// === НАСТРОЙКИ ПЕРЕМЕННЫХ (для демо) ===
	РежимПоказаПеременных = Перечисления.конс_РежимПоказаПеременных.ВТабло;
	ФильтрПеременных = ""; // Пустая строка = все переменные
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// === ПОДКЛЮЧЕНИЕ РЕДАКТОРА (обязательно) ===
	конс_ПодключаемаяКонсольКлиент.ПодключитьРедактор(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеРедактораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	// === ОБРАБОТКА СОБЫТИЙ РЕДАКТОРА (обязательно) ===
	конс_ПодключаемаяКонсольКлиент.ОбработчикПриНажатии(ЭтаФорма, ДанныеСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеРедактораДокументСформирован(Элемент)
	
	// === ЗАВЕРШЕНИЕ ИНИЦИАЛИЗАЦИИ (обязательно) ===
	конс_ПодключаемаяКонсольКлиент.ОбработчикДокументСформирован(ЭтаФорма);

	// === ПРИМЕРЫ РАСШИРЕНИЯ (опционально) ===
	// Добавление пользовательского контекста выполняется на сервере,
	// а загрузка в редактор - после формирования документа (см. HTMLДокументСформирован)
	Пример_ДобавитьПеременные();
	Пример_ДобавитьФункции();
	Пример_ДобавитьСниппеты();

	// === ЗАГРУЗКА ПОЛЬЗОВАТЕЛЬСКОГО КОНТЕКСТА (опционально) ===
	// Загружает в редактор переменные, функции и сниппеты,
	// добавленные на сервере в ПриСозданииНаСервере
	конс_ПодключаемаяКонсольКлиент.ЗагрузитьПользовательскийКонтекст(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьКод(Команда)
	
	// === ВЫПОЛНЕНИЕ КОДА (3 строки) ===
	Код = конс_ПодключаемаяКонсольКлиент.ПодготовитьКодСПеременными(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		ПоказатьПредупреждение(, "Нет кода для выполнения!");
		Возврат;
	КонецЕсли;
	
	Результат = конс_ПодключаемаяКонсольВызовСервера.ВыполнитьКодНаСервере(Код, ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.ВТабло"));
	конс_ПодключаемаяКонсольКлиент.ОбработатьРезультат(ЭтаФорма, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	конс_ПодключаемаяКонсольКлиент.ОткрытьНастройкиРедактора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаBSL(Команда)
	
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимЯзыка(ЭтаФорма, "bsl");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаJSON(Команда)
	
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимЯзыка(ЭтаФорма, "json");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаYAML(Команда)
	
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимЯзыка(ЭтаФорма, "yaml");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееВыполнениеКода(Команда)
	
	// === ПРИМЕР ВНЕШНЕГО ВЫПОЛНЕНИЯ КОДА ===
	// Используется, когда нужно выполнить код в своём контексте,
	// а не через стандартный ВыполнитьКод.
	// 
	// Например:
	// - Выполнение на клиенте с доступом к элементам формы
	// - Выполнение в контексте модуля объекта
	// - Выполнение с предварительной подготовкой данных
	
	// 1. Получаем подготовленный код
	// Используем настройки из реквизитов формы (меню "Переменные")
	МассивФильтра = ПолучитьМассивФильтраПеременных();
	
	ДанныеКода = конс_ПодключаемаяКонсольКлиент.ПолучитьКодДляВнешнегоВыполнения(
		ЭтаФорма,
		РежимПоказаПеременных,
		,
		МассивФильтра);
	
	Если Не ЗначениеЗаполнено(ДанныеКода.ИсходныйКод) Тогда
		ПоказатьПредупреждение(, "Нет кода для выполнения!");
		Возврат;
	КонецЕсли;
	
	// 2. Выполняем код в своём контексте
	ИнфоОшибки = Неопределено;
	
	Попытка
		// Здесь можно использовать свой Выполнить
		// Код уже содержит всё необходимое:
		// - Объявление ЗначенияПеременных
		// - Сбор значений переменных
		// - Сохранение во временное хранилище
		ВыполнитьКодНаСервере(ДанныеКода.Код);
	Исключение
		ИнфоОшибки = ИнформацияОбОшибке();
	КонецПопытки;
	
	// 3. Обрабатываем результат - покажет переменные или ошибку
	конс_ПодключаемаяКонсольКлиент.ОбработатьРезультатВнешнегоВыполнения(
		ЭтаФорма, ДанныеКода, ИнфоОшибки);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивФильтраПеременных()
	
	МассивФильтра = Новый Массив;
	
	// Маркер "[[NONE]]" означает "ничего не выбрано"
	Если ФильтрПеременных = "[[NONE]]" Тогда
		// Возвращаем пустой массив, но вызывающий код должен проверять ФильтрПеременных
		Возврат МассивФильтра;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФильтрПеременных) Тогда
		Части = СтрРазделить(ФильтрПеременных, ",", Ложь);
		Для Каждого Часть Из Части Цикл
			Имя = СокрЛП(Часть);
			Если ЗначениеЗаполнено(Имя) Тогда
				МассивФильтра.Добавить(Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивФильтра;
	
КонецФункции

&НаСервере
Процедура ВыполнитьКодНаСервере(Код)

Выполнить(Код);

КонецПроцедуры

// === УПРАВЛЕНИЕ ПЕРЕМЕННЫМИ ===

&НаКлиенте
Процедура УстановитьРежимВТабло(Команда)
	
	РежимПоказаПеременных = ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.ВТабло");
	ОбновитьПометкиРежимаПоказа();
	ПоказатьОповещениеПользователя("Переменные", , "Режим: В табло");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимВПодсказках(Команда)
	
	РежимПоказаПеременных = ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.ВПодсказках");
	ОбновитьПометкиРежимаПоказа();
	ПоказатьОповещениеПользователя("Переменные", , "Режим: В подсказках");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимНеОтображать(Команда)
	
	РежимПоказаПеременных = ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.НеОтображать");
	ОбновитьПометкиРежимаПоказа();
	ПоказатьОповещениеПользователя("Переменные", , "Режим: Не отображать");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПометкиРежимаПоказа()
	
	РежимВТабло = ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.ВТабло");
	РежимВПодсказках = ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.ВПодсказках");
	РежимНеОтображать = ПредопределенноеЗначение("Перечисление.конс_РежимПоказаПеременных.НеОтображать");
	
	Элементы.РежимВТабло.Пометка = (РежимПоказаПеременных = РежимВТабло);
	Элементы.РежимВПодсказках.Пометка = (РежимПоказаПеременных = РежимВПодсказках);
	Элементы.РежимНеОтображать.Пометка = (РежимПоказаПеременных = РежимНеОтображать);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПеременные(Команда)
	
	// Получаем все доступные переменные из кода
	ВсеПеременные = конс_ПодключаемаяКонсольКлиент.ПолучитьПеременныеИзКода(ЭтаФорма);
	
	Если ВсеПеременные.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "В коде не найдено переменных");
		Возврат;
	КонецЕсли;
	
	// Формируем список для выбора
	СписокВыбора = Новый СписокЗначений;
	ТекущийФильтр = ПолучитьМассивФильтраПеременных();
	ФильтрАктивен = ЗначениеЗаполнено(ФильтрПеременных); // Если фильтр не пуст - он активен
	
	Для Каждого ИмяПеременной Из ВсеПеременные Цикл
		// Если фильтр не активен - все отмечены
		// Если активен - отмечены только те, что в фильтре
		Если Не ФильтрАктивен Тогда
			Отмечено = Истина;
		Иначе
			Отмечено = (ТекущийФильтр.Найти(ИмяПеременной) <> Неопределено);
		КонецЕсли;
		СписокВыбора.Добавить(ИмяПеременной, ИмяПеременной, Отмечено);
	КонецЦикла;
	
	// Показываем диалог выбора
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПеременныеЗавершение", ЭтотОбъект);
	СписокВыбора.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Выберите переменные для отображения");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПеременныеЗавершение(СписокВыбора, ДополнительныеПараметры) Экспорт
	
	Если СписокВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Собираем выбранные переменные
	Выбранные = Новый Массив;
	Для Каждого Элемент Из СписокВыбора Цикл
		Если Элемент.Пометка Тогда
			Выбранные.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	// Если выбраны все - сбрасываем фильтр (пустая строка = все)
	Если Выбранные.Количество() = СписокВыбора.Количество() Тогда
		ФильтрПеременных = "";
		ПоказатьОповещениеПользователя("Переменные", , "Отображаются все переменные");
	ИначеЕсли Выбранные.Количество() = 0 Тогда
		// Ничего не выбрано - используем маркер "[[NONE]]"
		ФильтрПеременных = "[[NONE]]";
		ПоказатьОповещениеПользователя("Переменные", , "Переменные не будут отображаться");
	Иначе
		ФильтрПеременных = СтрСоединить(Выбранные, ", ");
		ПоказатьОповещениеПользователя("Переменные", , СтрШаблон("Выбрано переменных: %1", Выбранные.Количество()));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФильтрПеременных(Команда)
	
	ФильтрПеременных = "";
	ПоказатьОповещениеПользователя("Переменные", , "Фильтр сброшен - отображаются все переменные");
	
КонецПроцедуры

#КонецОбласти

#Область Примеры

////////////////////////////////////////////////////////////////////////////////
// ПРИМЕРЫ РАСШИРЕНИЯ ФУНКЦИОНАЛЬНОСТИ
// 
// Методы ниже демонстрируют возможности расширения редактора.
// Вызываются в ПриСозданииНаСервере - добавляют контекст.
// Загрузка контекста в редактор - в HTMLДокументСформирован.
////////////////////////////////////////////////////////////////////////////////

// Пример: Добавление пользовательских переменных
// 
// Переменные отображаются в автодополнении при вводе.
// При вводе точки после переменной появятся методы её типа.
//
&НаСервере
Процедура Пример_ДобавитьПеременные()
	
	// Вариант 1: По ОписаниюТипов (для объектов конфигурации)
	// При вводе "_Товар." появятся все реквизиты справочника
	Если Метаданные.Справочники.Найти("Номенклатура") <> Неопределено Тогда
		конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "_Товар",
			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	КонецЕсли;
	
	// Вариант 2: По типу через Тип() - для общих классов платформы
	// При вводе "_Данные." появятся методы: Вставить(), Свойство(), Количество() и т.д.
	конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "_Данные",
		Тип("Структура"));
	
	// При вводе "_Таблица." появятся методы: Добавить(), Найти(), Скопировать() и т.д.
	конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "_Таблица",
		Тип("ТаблицаЗначений"));
	
	// Вариант 3: По строке с именем типа
	Если Метаданные.Справочники.Найти("Контрагенты") <> Неопределено Тогда
		конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "_Клиент",
			"Справочник.Контрагенты");
	КонецЕсли;
	
	// Вариант 4: Простая переменная с указанием типа
	конс_ПодключаемаяКонсольСервер.ДобавитьПеременную(ЭтотОбъект, "_Результат", Тип("Массив"));
	
КонецПроцедуры

// Пример: Добавление пользовательских функций
// 
// Функции отображаются в автодополнении с описанием и сигнатурой.
// Реализация функций должна быть в модуле менеджера (см. ManagerModule.bsl).
//
&НаСервере
Процедура Пример_ДобавитьФункции()
	
	// Функция с параметрами
	ПараметрыФункции = Новый Массив;
	ПараметрыФункции.Добавить(конс_ПодключаемаяКонсольСервер.НовыйПараметрФункции(
		"Сумма", "Число", "Сумма заказа для расчёта"));
	ПараметрыФункции.Добавить(конс_ПодключаемаяКонсольСервер.НовыйПараметрФункции(
		"ПроцентСкидки", "Число", "Процент скидки (от 0 до 100)"));
	
	конс_ПодключаемаяКонсольСервер.ДобавитьФункциюВКонтекст(ЭтотОбъект,
		"ВычислитьСкидку",
		"Вычисляет скидку для клиента",
		ПараметрыФункции,
		"Число"); // тип возврата
	
	// Функция без параметров
	конс_ПодключаемаяКонсольСервер.ДобавитьФункциюВКонтекст(ЭтотОбъект,
		"ПолучитьТекущегоПользователя",
		"Возвращает текущего пользователя системы");
	
КонецПроцедуры

// Пример: Добавление сниппетов (шаблонов кода)
// 
// Сниппеты - быстрые шаблоны, разворачиваются по Tab.
// ${1}, ${2} - точки табуляции, ${0} - финальная позиция курсора.
//
&НаСервере
Процедура Пример_ДобавитьСниппеты()
	
	// Сниппет для цикла
	конс_ПодключаемаяКонсольСервер.ДобавитьСниппет(ЭтотОбъект,
		"Для",
		"Для ${1:Индекс} = ${2:0} По ${3:Количество} - 1 Цикл
		|	${0}
		|КонецЦикла;",
		"Цикл Для по числовому счётчику");
	
	// Сниппет для запроса
	конс_ПодключаемаяКонсольСервер.ДобавитьСниппет(ЭтотОбъект,
		"Запрос",
		"Запрос = Новый Запрос;
		|Запрос.Текст =
		|	""ВЫБРАТЬ
		|	|	${1:*}
		|	|ИЗ
		|	|	${2:Справочник.Номенклатура}"";
		|
		|Результат = Запрос.Выполнить();
		|Выборка = Результат.Выбрать();
		|
		|Пока Выборка.Следующий() Цикл
		|	${0}
		|КонецЦикла;",
		"Создание и выполнение запроса");
	
КонецПроцедуры

// Пример: Переопределение настроек редактора
// 
// Позволяет изменить настройки по умолчанию при инициализации.
// Раскомментируйте и используйте вместо стандартной инициализации.
//
// &НаСервере
// Процедура Пример_ИнициализацияСНастройками()
// 	
// 	Параметры = Новый Структура;
// 	Параметры.Вставить("ПереопределитьНастройки", Новый Структура);
// 	Параметры.ПереопределитьНастройки.Вставить("КартаКода", Ложь);
// 	Параметры.ПереопределитьНастройки.Вставить("Тема", "ТемнаяТема");
// 	
// 	конс_ПодключаемаяКонсольСервер.ИнициализироватьРедактор(
// 		ЭтотОбъект, УникальныйИдентификатор, Параметры);
// 	
// КонецПроцедуры

#КонецОбласти

#Область ТестированиеAPI

////////////////////////////////////////////////////////////////////////////////
// ТЕСТИРОВАНИЕ API РЕДАКТОРА
// 
// Команды для проверки работы различных параметров редактора.
////////////////////////////////////////////////////////////////////////////////

// Переключает режим "только чтение" редактора.
//
&НаКлиенте
Процедура ПереключитьТолькоЧтение(Команда)
	
	элементы.ПереключитьТолькоЧтение.Пометка = НЕ элементы.ПереключитьТолькоЧтение.Пометка;
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимТолькоЧтение(ЭтаФорма, элементы.ПереключитьТолькоЧтение.Пометка);
	
	Если элементы.ПереключитьТолькоЧтение.Пометка Тогда
		ПоказатьОповещениеПользователя("Режим только чтение", , "Редактирование запрещено");
	Иначе
		ПоказатьОповещениеПользователя("Режим редактирования", , "Редактирование разрешено");
	КонецЕсли;
	
КонецПроцедуры

// Вставляет тестовый текст в редактор.
//
&НаКлиенте
Процедура ВставитьТестовыйТекст(Команда)
	
	ТестовыйКод =
	"// Тестовый код для проверки редактора
	|Товар = Неопределено;
	|Количество = 100;
	|Цена = 1500.50;
	|
	|Если Товар <> Неопределено Тогда
	|	Сумма = Количество * Цена;
	|	Сообщить(""Итого: "" + Сумма);
	|КонецЕсли;
	|
	|// Проверка автодополнения - введите _Товар.
	|// Проверка сниппетов - введите Для или Запрос";
	
	конс_ПодключаемаяКонсольКлиент.УстановитьТекст(ЭтаФорма, ТестовыйКод);
	ПоказатьОповещениеПользователя("Текст", , "Тестовый код вставлен");
	
КонецПроцедуры

// Получает и показывает текущий текст редактора.
//
&НаКлиенте
Процедура ПолучитьТекст(Команда)
	
	Текст = конс_ПодключаемаяКонсольКлиент.ПолучитьТекст(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Текст) Тогда
		СтрокСообщение = СтрШаблон("Получено символов: %1, строк: %2", СтрДлина(Текст), СтрЧислоСтрок(Текст));
		ПоказатьОповещениеПользователя("Получение текста", , СтрокСообщение);
	Иначе
		ПоказатьОповещениеПользователя("Получение текста", , "Редактор пуст");
	КонецЕсли;
	
КонецПроцедуры

// Получает и показывает выделенный текст.
//
&НаКлиенте
Процедура ПолучитьВыделенныйТекст(Команда)
	
	Текст = конс_ПодключаемаяКонсольКлиент.ПолучитьВыделенныйТекст(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Текст) Тогда
		ПоказатьПредупреждение(, "Выделенный текст:" + Символы.ПС + Символы.ПС + Текст);
	Иначе
		ПоказатьОповещениеПользователя("Выделение", , "Текст не выделен");
	КонецЕсли;
	
КонецПроцедуры

// Очищает редактор.
//
&НаКлиенте
Процедура ОчиститьРедактор(Команда)
	
	конс_ПодключаемаяКонсольКлиент.ОчиститьТекст(ЭтаФорма);
	ПоказатьОповещениеПользователя("Очистка", , "Редактор очищен");
	
КонецПроцедуры

// Переключает на режим SQL-запроса.
//
&НаКлиенте
Процедура ПереключитьНаЗапрос(Команда)
	
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимЯзыка(ЭтаФорма, "bsl_query");
	ПоказатьОповещениеПользователя("Язык", , "Режим запроса 1С");
	
КонецПроцедуры

// Переключает на режим XML.
//
&НаКлиенте
Процедура ПереключитьНаXML(Команда)
	
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимЯзыка(ЭтаФорма, "xml");
	ПоказатьОповещениеПользователя("Язык", , "Режим XML");
	
КонецПроцедуры

// Переключает на режим СКД-запроса.
//
&НаКлиенте
Процедура ПереключитьНаСКД(Команда)
	
	конс_ПодключаемаяКонсольКлиент.УстановитьРежимЯзыка(ЭтаФорма, "dcs_query");
	ПоказатьОповещениеПользователя("Язык", , "Режим запроса СКД");
	
КонецПроцедуры

#КонецОбласти
